# Practical Lab on OSPF - Part 3: Default Route (optional)

This part is totally optional and could be skipped (you may come back latter on if you have enough time). 

## Access to the Internet. 
*R4* is the *ASBR* (*AS Border Router*) which has access to the Internet (i.e. a link to an *Internet Service Provider*). 
As the result it should generate a default route and send this as an *LSA* in the network (at least *Area 0*); so that all the other router will be aware of the presence of this exit at *R4*. 

If you look at *R4* routing table, it already has a default route configured (static route). 
```console
cnf-lab> kathara connect r4
root@r4:~# telnet localhost zebra
Trying 127.0.0.1...
Connected to localhost.
Escape character is '^]'.

Hello, this is Quagga (version 1.2.4).
Copyright 1996-2005 Kunihiro Ishiguro, et al.

User Access Verification

Password: 
R4> ena
Password: 
R4# sh ip route
Codes: K - kernel route, C - connected, S - static, R - RIP,
       O - OSPF, I - IS-IS, B - BGP, P - PIM, A - Babel, N - NHRP,
       > - selected route, * - FIB route

S>* 0.0.0.0/0 [1/0] is directly connected, Null0, ðŸ”´
O>* 10.0.0.1/32 [110/30] via 10.0.24.2, eth0, 18:43:15
  *                      via 10.0.34.3, eth1, 18:43:15
O>* 10.0.0.2/32 [110/20] via 10.0.24.2, eth0, 18:43:15
O>* 10.0.0.3/32 [110/20] via 10.0.34.3, eth1, 18:43:15
O   10.0.0.4/32 [110/10] is directly connected, dummy0, 18:44:00
C>* 10.0.0.4/32 is directly connected, dummy0
O>* 10.0.0.5/32 [110/30] via 10.0.34.3, eth1, 18:43:05
O>* 10.0.0.6/32 [110/30] via 10.0.24.2, eth0, 18:43:04
O>* 10.0.10.0/24 [110/20] via 10.0.24.2, eth0, 18:43:15
  *                       via 10.0.34.3, eth1, 18:43:15
O>* 10.0.15.0/24 [110/30] via 10.0.24.2, eth0, 18:43:15
  *                       via 10.0.34.3, eth1, 18:43:15
O>* 10.0.16.0/24 [110/30] via 10.0.24.2, eth0, 18:43:09
  *                       via 10.0.34.3, eth1, 18:43:09
O   10.0.24.0/24 [110/10] is directly connected, eth0, 18:44:00
C>* 10.0.24.0/24 is directly connected, eth0
O>* 10.0.26.0/24 [110/20] via 10.0.24.2, eth0, 18:43:15
R4# exit  
Connection closed by foreign host.
root@r4:~#
```
However you can check that this route is not announced in OSPF. 

The task here is to configure the network in order for R4 to generate an OSPF LSA from this default route. We won't give any specific indications this time as you should now have enough know-how to do it quickly. You may need to have a look at [Quagga documentation](https://www.nongnu.org/quagga/docs/quagga.html#OSPFv2). 


*Question* Provide the additional configuration line(s) of R4 which are required to generate a default route LSA. 